var data = {
 SOIL:{
    "header":"почва.",
    "slide":1,
    "problem":"Батарейки портят почву, из-за чего гибнет флора. Одна батарейка загрязняет 20 квадратных метров земли.",
    "solution":"Чтобы переработать батарейки нужно отправить их в один из специальных пунктов приема."
},
WATER:{
    "header":"вода.",
    "slide":2,
    "problem":"В лампочках содержится ртуть, она проникает в грунтовые воды, где происходит заражение всех обитателей планеты.",
    "solution":"Использованные лампочки следует сдать в пункт приема."
},
ATMOS:{
    "header":"атмосфера.",
    "slide":3,
    "problem":"При сожжении пластика в атмосферу выбрасывается огромное количество ядовитого дыма.",
    "solution":"При переработке пластика вредные вещества в атмосферу не попадают."
}   
}
//console.log(data[Object.keys(data)[slideIndex-1]]);